РУС/src/Enums/ТипыДней/ТипыДней.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДней</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Выходной</name>
  </enumValues>
</mdclass:Enum>

РУС/src/Documents/УстановкаТарифаНаУслугу/УстановкаТарифаНаУслугу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТарифаНаУслугу</name>
  <registerRecords>InformationRegister.ЦеныНаУслуги</registerRecords>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГрузовыхМест</name>
    <type>
      <types>CatalogRef.ТипыГрузовызРазмещений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>КоличествоОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДня</name>
      <type>
        <types>EnumRef.ТипыДней</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РУС/src/Catalogs/ТипыГрузовызРазмещений/ТипыГрузовызРазмещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыГрузовызРазмещений</name>
  <predefined>
    <items>
      <name>Хаб</name>
      <description>Хаб</description>
    </items>
    <items>
      <name>Шины</name>
      <description>Шины</description>
    </items>
    <items>
      <name>КГТ</name>
      <description>КГТ</description>
    </items>
    <items>
      <name>МГТ</name>
      <description>МГТ</description>
    </items>
  </predefined>
</mdclass:Catalog>

РУС/src/CommonModules/ПервичныйЗапускКонфигурацииСервер/Module.bsl
//@skip-check module-structure-method-in-regions
//@skip-check module-unused-method
Процедура СозданиеПервичныхДокументов() экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(УстановкаТарифаНаУслугу.Ссылка) КАК Ссылка
	|ИЗ
	|	Документ.УстановкаТарифаНаУслугу КАК УстановкаТарифаНаУслугу";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.Ссылка = 0 тогда
			
		НачатьТранзакцию();
		//@skip-check empty-except-statement
		Попытка
			СоздатьДокументУстановкиЦен(Справочники.ТипыГрузовызРазмещений.КГТ,Справочники.Услуги.Хранение,10,20);
			СоздатьДокументУстановкиЦен(Справочники.ТипыГрузовызРазмещений.МГТ,Справочники.Услуги.Хранение,10,20);
			СоздатьДокументУстановкиЦен(Справочники.ТипыГрузовызРазмещений.Хаб,Справочники.Услуги.Хранение,10,20);
			СоздатьДокументУстановкиЦен(Справочники.ТипыГрузовызРазмещений.Шины,Справочники.Услуги.Хранение,10,20);
			
			СоздатьДокументУстановкиЦен(Справочники.ТипыГрузовызРазмещений.КГТ,Справочники.Услуги.Обработка,100,200);
			СоздатьДокументУстановкиЦен(Справочники.ТипыГрузовызРазмещений.МГТ,Справочники.Услуги.Обработка,10,20);
			СоздатьДокументУстановкиЦен(Справочники.ТипыГрузовызРазмещений.Шины,Справочники.Услуги.Обработка,50,100);
			
			СоздатьДокументУстановкиЦенХаб();

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

//@skip-check module-structure-top-region
#Область СлужебныеМеханизмы

Процедура СоздатьДокументУстановкиЦен(ТипаОбработки,Услуга,ЦенаДень,ЦенаВыходной)
	
	нДок = Документы.УстановкаТарифаНаУслугу.СоздатьДокумент();
	//@skip-check use-non-recommended-method
	нДок.Дата = НачалоГода(ТекущаяДата());
	нДок.УстановитьНовыйНомер();
	нДок.Услуга = Услуга;
	нДок.ТипГрузовыхМест = ТипаОбработки;
	
	нСтр = нДок.Цены.Добавить();
	нСтр.Цена = ЦенаДень;
	нСтр.ТипДня = Перечисления.ТипыДней.Рабочий;
	
	нСтр = нДок.Цены.Добавить();
	нСтр.Цена = ЦенаВыходной;
	нСтр.ТипДня = Перечисления.ТипыДней.Выходной;
	
	нДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура СоздатьДокументУстановкиЦенХаб()
	
	нДок = Документы.УстановкаТарифаНаУслугу.СоздатьДокумент();
	//@skip-check use-non-recommended-method
	нДок.Дата = НачалоГода(ТекущаяДата());
	нДок.УстановитьНовыйНомер();
	нДок.Услуга = Справочники.Услуги.Обработка;
	нДок.ТипГрузовыхМест = Справочники.ТипыГрузовызРазмещений.Хаб;
	
	ЗаполнитьНовуюСтроку(нДок,500,0,500);
	ЗаполнитьНовуюСтроку(нДок,200,500,1000);
	ЗаполнитьНовуюСтроку(нДок,100,1000,2000);
	ЗаполнитьНовуюСтроку(нДок,70,2000,5000);
	ЗаполнитьНовуюСтроку(нДок,50,5000,0);
	
	нДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку(нДок,Цена,КоличествоОт = 0,КоличествоДо = 0)
	нСтр = нДок.Цены.Добавить();
	нСтр.Цена = Цена;
	нСтр.ТипДня = Перечисления.ТипыДней.Рабочий;
	нСтр.КоличествоОт = КоличествоОт;
	нСтр.КоличествоДо = КоличествоДо;
	
	нСтр = нДок.Цены.Добавить();
	нСтр.Цена = Цена*2;
	нСтр.ТипДня = Перечисления.ТипыДней.Выходной;
	нСтр.КоличествоОт = КоличествоОт;
	нСтр.КоличествоДо = КоличествоДо;
КонецПроцедуры

#КонецОбласти
